{"jolvary98":[{"\u003d\u003d\u003d Farming Valley\u003d\u003d\u003d":false},{"These first achievements are to give you a helping hand in the beginning of this pack":false},{"Get some glass bottles and fill them with water (Right click water with them), to stay hydrated":true},{"Mine some iron, and craft a bucket (Note: modded ores does not spawn in world, you buy those from the blacksmith)!":true},{"Summon The Harvest Goddess and begin the tutorial (See the book \"Summon The Harvest Goddess\")!":true},{"Talk with her again, and she should begin to tell you how to begin your town!":true},{"Get the logs she needs, then hold them in your hand and talk with her again!":true},{"Build the Carpenter!":true},{"Spawn the Harvest Goddess again to continue tutorial!":true},{"Speak with Jade, and ask her how to farm crops!":true},{"Get the Turnip seeds from Jade, and grow the seeds!":true},{"Give the Turnips back to Jade once grown!":true},{"Buy Shipment Box from the Carpenter!":true},{"Sell your fish/crops/etc by right clicking the Shipment Box on the ground, and then sleep to get your money!":true},{"Build the General Store!":true},{"Build the Animal Ranch!":false},{"Build the Poultry Farm!":true},{"Get Cows, Sheeps, Chickens! Note these do not spawn in the world":false},{"Other things to do in no specific order, including some tips":false},{"Make an achievement stand for your achievement book!":true},{"Build the Blacksmith!":false},{"Build the Cafe!":false},{"Build the Church!":false},{"Build the Clockmaker!":false},{"Build the Fishing Hole!":false},{"Build the Fishing Hut!":false},{"Build the Goddess Pond!":false},{"Build the Mining Hill!":false},{"Reach lvl 2 in the Mining Hill!":false},{"Build the Mining Hut!":false},{"Build the Townhall!":false},{"Get a total of 10 hearts!":false},{"Get a Unbound Soul Shard (Req a Nether Star instead of Diamond)!":false},{"Buy a Soul Cage!":false},{"Get a Fishing Rod!":true},{"Buy a Diamond Fishing Rod, and fish up 5 different fish!":false},{"Get a full set of Neptunium armor!":false},{"Fish up the Message In A Bottle!":false},{"Make a Empty Canteen and a Charcoal Filter. Then combine them for a Filtered Water Canteen!":false},{"Make Golden Apple Juice to restore some hydration!":false},{"Make a Elven Trade, using Botania!":false},{"Get a full set of Terrasteel Armor from Botania!":false},{"Build a Forestry Multiblock Farm!":false},{"Drink some Short Mead from Forestry!":false},{"Breed two bees together, using Forestry!":false},{"Buy all the pets from Candice!":false},{"Setup a Drawer Controller together with other drawers!":false},{"Setup a Excavator (MultiBlock) using Immersive Engineering!":false},{"Kill the Wither!":false},{"Kill the Ender Dragon!":false},{"Get a Spell Programmer from Psi!":false},{"Get the Diamond Chisel and Diamond Bit Saw from Chisels \u0026 Bits!":false},{"Find Bailey the villager, and complete 10 daily quest!":false},{"Tame a wolf, and equip it with Diamond Wolf Armor!":false},{"Setup a small Refined Storage System, with 1 4K Storage Disk!":false},{"Fill a Refined Storage Drive with 64K Storage Disk!":false},{"Craft the iChisel!":false},{"Buy the Magic Bean!":false},{"Buy the Stirrups and ride a Pigmen!":false},{"Buy a Sack of Storage!":false},{"Setup a Tunnel Bore with Diamond Bore Head from Railcraft!":false}]}